## Machine Learning Analysis using Coffee Sales and Weather Data

In [15]:
import pandas as pd
from sqlalchemy import create_engine

In [16]:
import os
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv

In [17]:
load_dotenv()

DB_NAME = os.getenv("MYSQL_DATABASE")
DB_USER = os.getenv("MYSQL_USER")
DB_PASSWORD = os.getenv("MYSQL_PASSWORD")
DB_HOST = "127.0.0.1"
DB_PORT = 3306

In [18]:
engine = create_engine(
    f"mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
)

Read coffee sales data from MySQL running inside Docker

In [19]:
coffe_data = pd.read_sql(
    sql="SELECT * FROM coffee_sales",
    con=engine
)

In [20]:
coffe_data.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,total_sales,month,hour,weekday
0,1,2023-01-01,0 days 07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg,6.0,2023-01,7,Sunday
1,2,2023-01-01,0 days 07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday
2,3,2023-01-01,0 days 07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,9.0,2023-01,7,Sunday
3,4,2023-01-01,0 days 07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm,2.0,2023-01,7,Sunday
4,5,2023-01-01,0 days 07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday

 Read daily_weather data from MySQL running inside Docker

In [21]:
weather= pd.read_sql(
    sql="SELECT * FROM daily_weather",
    con=engine
)

In [22]:
weather.head()

         date  temperature_2m_mean
0  2023-01-01              8.78542
1  2023-01-02              7.98125
2  2023-01-03              9.69167
3  2023-01-04             13.08130
4  2023-01-05              9.91250

In [23]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   date                 181 non-null    object
 1   temperature_2m_mean  181 non-null    float64
dtypes: float64(1), object(1)
memory usage: 3.0+ KB

In [24]:
coffe_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 15 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   transaction_id    149116 non-null  object
 1   transaction_date  149116 non-null  datetime64[ns]
 2   transaction_time  149116 non-null  timedelta64[ns]
 3   transaction_qty   149116 non-null  int64
 4   store_id          149116 non-null  object
 5   store_location    149116 non-null  object
 6   product_id        149116 non-null  object
 7   unit_price        149116 non-null  float64
 8   product_category  149116 non-null  object
 9   product_type      149116 non-null  object
 10  product_detail    149116 non-null  object
 11  total_sales       149116 non-null  float64
 12  month             149116 non-null  object
 13  hour              149116 non-null  int64
 14  weekday           149116 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(9), timedelta64[ns](1)
memory usage: 17.1+ MB

In [27]:
coffe_data.rename(columns={'transaction_date':'date'},inplace=True)
coffe_data.head()

,transaction_id,date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,total_sales,month,hour,weekday
0,1,2023-01-01,0 days 07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg,6.0,2023-01,7,Sunday
1,2,2023-01-01,0 days 07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday
2,3,2023-01-01,0 days 07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,9.0,2023-01,7,Sunday
3,4,2023-01-01,0 days 07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm,2.0,2023-01,7,Sunday
4,5,2023-01-01,0 days 07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday

In [ ]:
weather['date'] = pd.to_datetime(weather['date'])
coffe_data['date']=pd.to_datetime(coffe_data['date'])

 Merge datasets to create a unified dataset for machine learning analysis

In [29]:
merge=pd.merge(coffe_data,weather,on='date',how='left')

In [31]:
merge.head()

,transaction_id,date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,total_sales,month,hour,weekday,temperature_2m_mean
0,1,2023-01-01,0 days 07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg,6.0,2023-01,7,Sunday,8.78542
1,2,2023-01-01,0 days 07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday,8.78542
2,3,2023-01-01,0 days 07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg,9.0,2023-01,7,Sunday,8.78542
3,4,2023-01-01,0 days 07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm,2.0,2023-01,7,Sunday,8.78542
4,5,2023-01-01,0 days 07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg,6.2,2023-01,7,Sunday,8.78542

In [33]:
merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   transaction_id       149116 non-null  object
 1   date                 149116 non-null  datetime64[ns]
 2   transaction_time     149116 non-null  timedelta64[ns]
 3   transaction_qty      149116 non-null  int64
 4   store_id             149116 non-null  object
 5   store_location       149116 non-null  object
 6   product_id           149116 non-null  object
 7   unit_price           149116 non-null  float64
 8   product_category     149116 non-null  object
 9   product_type         149116 non-null  object
 10  product_detail       149116 non-null  object
 11  total_sales          149116 non-null  float64
 12  month                149116 non-null  object
 13  hour                 149116 non-null  int64
 14  weekday              149116 non-null  object
 15  temperature_2m_mean  149116 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(2), object(9), timedelta64[ns](1)
memory usage: 18.2+ MB